const evaluationForm = [
    {
        name: "对老师创设的情境，我有兴趣，我喜欢老师的课。",
        info:'',
        code:'',
        parameter: [
            {id: 5, msg: "你太牛逼了！大佬我跪舔你"},//<100||>80
            {id: 4, msg: "挺好的继续努力"},//<80||>60
            {id: 3, msg: "你在创意设计方面表现还行，但还不够好"},//<60||>40
            {id: 2, msg: "你这表现一般般"},//<40||>20
            {id: 1, msg: "您在创意设计方面表现太差了，自己主动辞职吧"},//<20
        ]
    },
    {
        name: "老师上课精神饱满，讲课认真负责。",
        info:'',
        code:'',
        parameter: [
            {id: 5, msg: "在上课认真程度上面，你太牛逼了！大佬我跪舔你"},
            {id: 4, msg: "在上课认真程度上面，挺好的继续努力"},
            {id: 3, msg: "在上课认真程度上面，你在创意设计方面表现还行，但还不够好"},
            {id: 2, msg: "在上课认真程度上面，你这表现一般般"},
            {id: 1, msg: "在上课认真程度上面，您在创意设计方面表现太差了，自己主动辞职吧"},
        ]
    },
    {
        name: "经常与学生沟通，征求对教学的意见，鼓励学生自信、奋进。",
        info:'',
        code:'',
        parameter: [
            {id: 5, msg: "在与学生沟通方面，你太牛逼了！大佬我跪舔你"},
            {id: 4, msg: "在与学生沟通方面，挺好的继续努力"},
            {id: 3, msg: "在与学生沟通方面，你在创意设计方面表现还行，但还不够好"},
            {id: 2, msg: "在与学生沟通方面，你这表现一般般"},
            {id: 1, msg: "在与学生沟通方面，您在创意设计方面表现太差了，自己主动辞职吧"},
        ]
    },
    {
        name: "尊重学生，不伤害学生的自尊心，且一视同仁。",
        info:'',
        code:'',
        parameter: [
            {id: 5, msg: "在尊重学生方面，你太牛逼了！大佬我跪舔你"},
            {id: 4, msg: "在尊重学生方面，挺好的继续努力"},
            {id: 3, msg: "在尊重学生方面，还不够好"},
            {id: 2, msg: "在尊重学生方面，你这表现一般般"},
            {id: 1, msg: "在尊重学生方面，不上课不尊重同学们自己卷铺盖吧"},
        ]
    },
    {
        name: "教学内容充实，条理清楚，重点突出，难点讲解透彻。",
        info:'',
        code:'',
        parameter: [
            {id: 5, msg: "在教学内容方面，你太牛逼了！大佬我跪舔你"},
            {id: 4, msg: "在教学内容方面，挺好的继续努力"},
            {id: 3, msg: "在教学内容方面，你在创意设计方面表现还行，但还不够好"},
            {id: 2, msg: "在教学内容方面，你这表现一般般"},
            {id: 1, msg: "在教学内容方面，您在创意设计方面表现太差了，自己主动辞职吧"},
        ]
    },
    {
        name: "讲课内容熟练，能理论与实操结合，注重应用。",
        info:'',
        code:'',
        parameter: [
            {id: 5, msg: "在课程内容方面，你太牛逼了！大佬我跪舔你"},
            {id: 4, msg: "在课程内容方面，挺好的继续努力"},
            {id: 3, msg: "在课程内容方面，你在创意设计方面表现还行，但还不够好"},
            {id: 2, msg: "在课程内容方面，你这表现一般般"},
            {id: 1, msg: "在课程内容方面，您在创意设计方面表现太差了，自己主动辞职吧"},
        ]
    },
    {
        name: "能结合讲课内容，介绍本学科的及行业的发展动态。 所讲授内容符合行业市场需求及就业前景。",
        info:'',
        code:'',
        parameter: [
            {id: 5, msg: "在课文具体内容方面，你太牛逼了！大佬我跪舔你"},
            {id: 4, msg: "在课文具体内容方面，挺好的继续努力"},
            {id: 3, msg: "在课文具体内容方面，你在创意设计方面表现还行，但还不够好"},
            {id: 2, msg: "在课文具体内容方面，你这表现一般般"},
            {id: 1, msg: "在课文具体内容方面，您在创意设计方面表现太差了，自己主动辞职吧"},
        ]
    },
]

module.exports = {
    evaluationForm: evaluationForm
}